{
    "workshop1": {
        "name": "Serkan Özal, Hamit Burak Emre & Özge Lüle",
        "photo": "workshop1.gif",
        "title": "Building a 100% Serverless Blog Site Application with the Right Observability and Security",
        "description": "In the workshop, at first, we will build blog post handling and processing parts of a blog site application from scratch step by step on AWS Lambda. Applications will be interacted and pipelined with each other through AWS services like API Gateway, SQS, SNS, DynamoDB and many others. We will discuss the best practices for debugging a serverless application written in Node.js while developing the application. Then, we will grasp the importance of observability in distributed serverless applications and learn how to monitor this application s with CloudWatch, X-Ray, and Thundra. Finally, we will talk about potential security threats for a serverless application and how to address those with least privileged IAM permissions and Thundra’s built-in security. <br/>Take-aways: <br/>* Understanding the internals and capabilities of AWS components in a serverless architecture. <br/>* Discovering different ways of debugging a serverless application <br/>* Understanding of why observability is crucial for your application <br/>* The ways of gaining observability with cloud provided solutions and with Thundra <br/>* Understanding common security pitfalls in serverless applications and potential solutions to these.",
        "about": "<b>Serkan Özal</b> is the CTO and founder of Thundra (www.thundra.io), which is serverless centric application debugging, monitoring and security solution, and living in Turkey. He has 10+ years of expertise in software development and he is a Ph.D. candidate at METU. He is an AWS Certified Engineer and has a patent about cache eviction on distributed environments. He is mainly working on serverless architectures, distributed systems, and monitoring tools. <br/><b>Hamit Burak Emre</b> is a software engineer at Thundra; dealing with monitoring, debugging and security solutions for serverless environments. He is also an AWS Certified Developer, speaking and making workshops on serverless observability. He loves playing video games, soccer and learning French(oui). <br/><b>Özge Lüle</b> is a software engineer at Thundra, observability, and security solution for serverless centric applications. She is pleased to be a part and contribute to the serverless community. She is an AWS Certified Developer. Loves board games, video games, anything fiction."
    },
    "workshop2": {
        "name": "Benjamin Smith & Julian Wood",
        "photo": "workshop2.gif",
        "title": "Serverless image processing workflows at scale with AWS Step Functions",
        "description": "In this workshop, you’ll build a deep learning image profile application with AWS Step Functions by orchestrating multiple AWS services such as Amazon Dynamo DB, Amazon S3, Amazon Recognition and AWS Lambda. You’ll then see how to integrate this workflow with your own applications by fronting it with an API or triggering from an Amazon S3 upload event. <br/>With AWS Lambda, you can write code to process images and files without provisioning servers. But at scale, how do you coordinate multiple parallel processing steps, catch errors and retry failures, and keep your code modular and maintainable? AWS Step Functions comes to the rescue.",
        "about": "<b>Benjamin Smith</b><br/>I'm a Senior developer advocate at AWS with a passion for serverless, automation and open source technology. I love learning from other developers and sharing my own experience and knowledge with serverless application development.<br/><br/><b>Julian Wood</b><br/>I am a Developer Advocate for AWS Serverless. I work with the serverless product teams at AWS to create great serverless content. I help people love serverless more and also act as the feedback conduit from developers and builders to help make AWS serverless the best place to run applications."
    },
    "simona-cotin": {
        "name": "Simona Cotin",
        "photo": "simona-cotin.jpg",
        "title": "Serverless at the end of the Universe",
        "description": "Serverless functions are extremely good at what they do and provide planet-scale computing power for your applications. The one thing where serverless functions fall short is when it comes to state management. When missing state management abilities building up complex flows in your data processing will prove to be quite daunting, and most often than not will require you to provide custom mechanisms for enabling you to communicate between your functions. I am here to explain the challenges and what we can do to tackle them in a way that is extensible and suitable for production environments.",
        "about": "Cloud Developer Advocate Simona Cotin is a web developer with a passion for teaching. She spends most of her time tinkering with JavaScript in the cloud and sharing her experience with other developers at community events like meetups and conferences or online. As a Cloud Developer Advocate, Simona engages with the web community to help create a great developer experience with Azure. She loves shipping code to production and has built network data analytics platforms using Angular, Typescript, React, and Node."
    },
    "benjamin-smith": {
        "name": "Benjamin Smith",
        "photo": "benjamin-smith.jpg",
        "title": "Go serverless with the new LAMP stack for 2020",
        "description": "Using this new LAMP stack to build serverless applications allows PHP developers to benefit from the agility and scalability enabled by the serverless paradigm, all without needing to manage servers. <br/>I'll demo how to get started running your PHP code using functions as a service. You'll learn how to connect to databases at scale with spiky workloads, and continue to use your favourite libraries and tools, without impacting performance or availability. <br/>Learn how to become a serverless PHP developer, and use the world's most popular web runtime to build scalable, agile apps without the server management",
        "about": "I'm a Senior developer advocate at AWS with a passion for serverless, automation and open source technology. I love learning from other developers and sharing my own experience and knowledge with serverless application development."
    },
    "mete-atamel": {
        "name": "Mete Atamel",
        "photo": "mete-atamel.jpg",
        "title": "Serverless agility meets container flexibility with Knative and Cloud Run",
        "description": "When you build an app, you typically need to choose agility with serverless or flexibility with containers but not both. But why does it have to be that way? Wouldn't it be nice to have the best of both worlds? In this talk, we'll look at the open source project Knative and its managed cousin Cloud Run on Google Cloud. Through a series of demos, we'll see how these projects enable you to quickly deploy containers in a serverless way on wherever you want, either on-prem or in the cloud. ",
        "about": "Mete is a Developer Advocate at Google, focused on helping developers with Google Cloud. As a long-time Java and C# developer, he likes to compare the two ecosystems. Prior to Google, he worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from the island of Cyprus, he currently lives in Greenwich of London, not too far away from the prime meridian."
    },
    "serkan-ozal": {
        "name": "Serkan Özal",
        "photo": "serkan-ozal.jpg",
        "title": "Write Once, Debug Everywhere from Development to Production",
        "description": "In God’s world, debugging may not be necessary as they can write perfect code which never fails. But we mortals are error prone and can make mistakes while developing one way or another. And even we may not be aware of the bug during development but occur on production. So debugging is a continuous process during all the phases of software development lifecycle. As debugging is always there since the beginning of software industry, there are already a bunch of approaches and best practices. However, with the microservice and serverless evolution, these practices need to be updated according to the new paradigms.<br/>In this talk, we will walk through <br/>- challenges of debugging serverless applications <br/>- new approaches (including live and offline debugging) to debug serverless applications <br/>- real life cases (bug hunting stories) where debugging is a crucial task",
        "about": "Serkan Özal is the CTO and founder of Thundra (www.thundra.io), which is serverless centric application debugging, monitoring and security solution, and living in Turkey. He has 10+ years of expertise in software development and he is a PhD candidate at METU. He is an AWS Certified Engineer and has a patent about cache eviction on distributed environments. He is mainly working on serverless architectures, distributed systems and monitoring tools."
    },
    "luca-bianchi": {
        "name": "Luca Bianchi",
        "photo": "luca-bianchi.png",
        "title": "Serving deep learning models through a serverless pipeline",
        "description": "This talk is the story about how we implemented our Image Memorability feature of Neosperience Cloud. It starts right after the last line of model notebook has been written and presents how we managed to bring it into production, built endpoints, events and lambdas to make it a full fledged service. We’ll discuss about REST interfaces for image upload to S3, SQS events to handle coordination, and web sockets to push incremental inference results to the client.",
        "about": "I currently serve as CTO at Neosperience, an italian based company that develop a SaaS cloud platform on AWS, able to understand what makes every customer unique and engage her in a tailored 1:1 experience. I followed architecture choices through the years, making Neosperience Cloud 100% serverless. I am also co-organizer of Serverless Meetup Italy and ServerlessDays Milano"
    },
    "michal-knobel": {
        "name": "Michal Knobel",
        "photo": "michal-knobel.png",
        "title": "Serverless Event Store",
        "description": "This talk is about serverless journey at Coople, where from last November we are working on changing monolith into full serverless system. It is about our successes but also about failures during developing and introducing the serverless event store and read models. It is also about changing culture from dev to devops and selling it to the company.",
        "about": "My name is Michal Knobel. I am a Solution Architect at Coople with more than 10 years of experience. I am quite new to serverless, but I have already learned a lot. Convincing people to Serverless is very hard but I went through this journey with 5 teams at Coople, so the audience at ServerlessDays should be easier to do."
    },
    "guillaume-blaquiere": {
        "name": "Guillaume Blaquiere",
        "photo": "guillaume-blaquiere.jpg",
        "title": "Secure serverless product with API Key",
        "description": "This session will present how to leverage of Cloud Endpoint deployed on Cloud Run for securing App Engine, Cloud Run and Cloud Function with an API keys and the security trade offs that this choice implies.",
        "about": "Guillaume Blaquiere is a GDE on Cloud Platform since 2019 and works at Veolia as Scrum Master and Lead Developer in the Digital Factory. Java developer since more than 15 years, and despite positions of responsibilities, he has always kept his wish of create, develop, discover and test new solution, especially in the Cloud, the machine learning or Python and Go language.</br>Innovation addict and Google Cloud 3x certified, writer and speaker on his free time, he's fascinated by the serverless solution and all the 'usual' problem that it solves"
    },
    "christian-nwamba": {
        "name": "Christian Nwamba",
        "photo": "christian-nwamba.jpg",
        "title": "Building Schedulers with Durable Functions",
        "description": "Once in a while, you would want your application to be aware of some kind of state. This demand can get tricky because HTTP is designed to not have any state therefore you have to manage state either in the user’s browser/app or on your server. Durable Functions is pushing the boundaries and giving you some tools to build APIs that can keep track of state. You can take advantage of these stateful serverless functions to simplify complex business logic like event scheduling.",
        "about": "Chris is a Senior Cloud Advocate at Microsoft where he enjoys making stuff with Serverless and JavaScript  for other developers."
    },
    "mirko-eberlein": {
        "name": "Mirko Eberlein",
        "photo": "mirko-eberlein.jpg",
        "title": "Run a rock solid website with the serverless CloudeeCMS",
        "description": "With the Serverless CloudeeCMS you can run a rock solid modern enterprise grade website, even if you’re on a tight budget.<ul><li>No limitations in website layout design</li><li>Easy to use online editor, no command line hacking</li><li>Your data in your hands. Runs in your own AWS account</li><li>Integrate powerful site search engines</li><li>OpenSource and extensible</li><li>Secure by design, website and editor / DB are decoupled from each other</li><li>Easy backup / restore function</li></ul>",
        "about": "Mirko Eberlein is Senior Developer at WebGate Consulting and an active part of the CloudeeCMS team. He has been programming with passion for over 25 years."
    }

}