{
    "workshop1": {
        "name": "Serkan Özal, Hamit Burak Emre & Özge Lüle",
        "photo": "workshop1.gif",
        "title": "Building a 100% Serverless Blog Site Application with the Right Observability and Security",
        "description": "In the workshop, at first, we will build blog post handling and processing parts of a blog site application from scratch step by step on AWS Lambda. Applications will be interacted and pipelined with each other through AWS services like API Gateway, SQS, SNS, DynamoDB and many others. We will discuss the best practices for debugging a serverless application written in Node.js while developing the application. Then, we will grasp the importance of observability in distributed serverless applications and learn how to monitor this application s with CloudWatch, X-Ray, and Thundra. Finally, we will talk about potential security threats for a serverless application and how to address those with least privileged IAM permissions and Thundra’s built-in security. <br/>Take-aways: <br/>* Understanding the internals and capabilities of AWS components in a serverless architecture. <br/>* Discovering different ways of debugging a serverless application <br/>* Understanding of why observability is crucial for your application <br/>* The ways of gaining observability with cloud provided solutions and with Thundra <br/>* Understanding common security pitfalls in serverless applications and potential solutions to these.",
        "about": "<b>Serkan Özal</b> is the CTO and founder of Thundra (www.thundra.io), which is serverless centric application debugging, monitoring and security solution, and living in Turkey. He has 10+ years of expertise in software development and he is a Ph.D. candidate at METU. He is an AWS Certified Engineer and has a patent about cache eviction on distributed environments. He is mainly working on serverless architectures, distributed systems, and monitoring tools. <br/><b>Hamit Burak Emre</b> is a software engineer at Thundra; dealing with monitoring, debugging and security solutions for serverless environments. He is also an AWS Certified Developer, speaking and making workshops on serverless observability. He loves playing video games, soccer and learning French(oui). <br/><b>Özge Lüle</b> is a software engineer at Thundra, observability, and security solution for serverless centric applications. She is pleased to be a part and contribute to the serverless community. She is an AWS Certified Developer. Loves board games, video games, anything fiction."
    },
    "workshop2": {
        "name": "Benjamin Smith",
        "photo": "benjamin-smith.jpg",
        "title": "Serverless image processing workflows at scale with AWS Step Functions",
        "description": "In this workshop, you’ll build a deep learning image profile application with AWS Step Functions by orchestrating multiple AWS services such as Amazon Dynamo DB, Amazon S3, Amazon Recognition and AWS Lambda. You’ll then see how to integrate this workflow with your own applications by fronting it with an API or triggering from an Amazon S3 upload event. <br/>With AWS Lambda, you can write code to process images and files without provisioning servers. But at scale, how do you coordinate multiple parallel processing steps, catch errors and retry failures, and keep your code modular and maintainable? AWS Step Functions comes to the rescue.",
        "about": "I'm a Senior developer advocate at AWS with a passion for serverless, automation and open source technology. I love learning from other developers and sharing my own experience and knowledge with serverless application development."
    },
    "simon-young": {
        "name": "Simon Young",
        "photo": "simon-young.jpg",
        "title": "The Difficult Second Album",
        "description": "In 2019 the team behind LEGO.com delivered the engineering equivalent of the world-beating breakthrough debut album - moving in just over a year from an inflexible and monolithic on-premise commerce architecture to the brave new world of headless, serverless commerce running fully in the public cloud - with fantastic results for the LEGO Group. <br/>Now in 2020 we stand with the Difficult Second Album ahead of us. How do we beat - in fact how do we even match - the killer debut? How do we make sure our second opus is less like The Stone Roses’ ‘The Second Coming’ and more like Nirvana’s ‘Nevermind’?<br/>In this talk, Simon Young - Director of Software Engineering & Architecture at The LEGO Group - will take you through the key success factors of the LEGO.com engineering transformation to date, look at the challenges of running a serverless-based platform at scale and consider how to maintain that architectural flexibility as the serverless landscape continues to evolve and the product and the teams responsible for the product scale to meet ever-increasing expectations.",
        "about": "Simon is an experienced software engineering leader and currently Director of Software Engineering and Architecture at the LEGO Group where he is responsible for the engineering team behind LEGO.com."
    },
    "benjamin-smith": {
        "name": "Benjamin Smith",
        "photo": "benjamin-smith.jpg",
        "title": "Go serverless with the new LAMP stack for 2020",
        "description": "Using this new LAMP stack to build serverless applications allows PHP developers to benefit from the agility and scalability enabled by the serverless paradigm, all without needing to manage servers. <br/>I'll demo how to get started running your PHP code using functions as a service. You'll learn how to connect to databases at scale with spiky workloads, and continue to use your favourite libraries and tools, without impacting performance or availability. <br/>Learn how to become a serverless PHP developer, and use the world's most popular web runtime to build scalable, agile apps without the server management",
        "about": "I'm a Senior developer advocate at AWS with a passion for serverless, automation and open source technology. I love learning from other developers and sharing my own experience and knowledge with serverless application development."
    },
    "mete-atamel": {
        "name": "Mete Atamel",
        "photo": "mete-atamel.jpg",
        "title": "Serverless agility meets container flexibility with Knative and Cloud Run",
        "description": "When you build an app, you typically need to choose agility with serverless or flexibility with containers but not both. But why does it have to be that way? Wouldn't it be nice to have the best of both worlds? In this talk, we'll look at the open source project Knative and its managed cousin Cloud Run on Google Cloud. Through a series of demos, we'll see how these projects enable you to quickly deploy containers in a serverless way on wherever you want, either on-prem or in the cloud. ",
        "about": "Mete is a Developer Advocate at Google, focused on helping developers with Google Cloud. As a long-time Java and C# developer, he likes to compare the two ecosystems. Prior to Google, he worked at Microsoft, Skype, Adobe, EMC, and Nokia building apps and services on various web, mobile and cloud platforms. Originally from the island of Cyprus, he currently lives in Greenwich of London, not too far away from the prime meridian."
    }

}