{
    "workshop1": {
        "name": "Serkan Ozal, Hamit Burak Emre & Ozge Lule",
        "photo": "workshop1.gif",
        "title": "Building a 100% Serverless Blog Site Application with the Right Observability and Security",
        "description": "In the workshop, at first, we will build blog post handling and processing parts of a blog site application from scratch step by step on AWS Lambda. Applications will be interacted and pipelined with each other through AWS services like API Gateway, SQS, SNS, DynamoDB and many others. We will discuss the best practices for debugging a serverless application written in Node.js while developing the application. Then, we will grasp the importance of observability in distributed serverless applications and learn how to monitor this application s with CloudWatch, X-Ray, and Thundra. Finally, we will talk about potential security threats for a serverless application and how to address those with least privileged IAM permissions and Thundra’s built-in security. <br/>Take-aways: <br/>* Understanding the internals and capabilities of AWS components in a serverless architecture. <br/>* Discovering different ways of debugging a serverless application <br/>* Understanding of why observability is crucial for your application <br/>* The ways of gaining observability with cloud provided solutions and with Thundra <br/>* Understanding common security pitfalls in serverless applications and potential solutions to these.",
        "about": "<b>Serkan Özal</b> is the CTO and founder of Thundra (www.thundra.io), which is serverless centric application debugging, monitoring and security solution, and living in Turkey. He has 10+ years of expertise in software development and he is a Ph.D. candidate at METU. He is an AWS Certified Engineer and has a patent about cache eviction on distributed environments. He is mainly working on serverless architectures, distributed systems, and monitoring tools. <br/><b>Hamit Burak Emre</b> is a software engineer at Thundra; dealing with monitoring, debugging and security solutions for serverless environments. He is also an AWS Certified Developer, speaking and making workshops on serverless observability. He loves playing video games, soccer and learning French(oui). <br/><b>Özge Lüle</b> is a software engineer at Thundra, observability, and security solution for serverless centric applications. She is pleased to be a part and contribute to the serverless community. She is an AWS Certified Developer. Loves board games, video games, anything fiction."
    },
    "danilo-poccia": {
        "name": "Danilo Poccia",
        "photo": "danilo-poccia.jpg",
        "title": "Taking Serverless to the Next Level",
        "description": "What are the top best practices to build and run applications without thinking about servers? Model your serverless components as templates and deploy your infrastructure as config to leverage best practices such as code reviews. Step-through and debug your code with a local execution environment. Coordinate and manage the state of each distributed component. Continuously deliver your code in production using application lifecycle management tools. Enable gradual, safe deployments. To support our findings, we’ll review customer case studies to see what they did, why, and which benefits they got most.",
        "about": "Danilo works with startups and companies of any size to support their innovation. In his role as Evangelist at Amazon Web Services, he leverages his experience to help people bring their ideas to life, focusing on serverless architectures and event-driven programming, and on the technical and business impact of machine learning and edge computing. He is the author of AWS Lambda in Action from Manning."
    }

}